---
kind: method
id: M:Autodesk.Revit.DB.ColorFillScheme.GetEntries
source: html/bb3b650c-2718-28b7-c4bb-be3f80fb3e32.htm
---
# Autodesk.Revit.DB.ColorFillScheme.GetEntries Method

Retrieves copies of all entries.

## Syntax (C#)
```csharp
public IList<ColorFillSchemeEntry> GetEntries()
```

## Remarks
This method recalculates entries based on the current parameter values of the elements colored by the scheme.